Revit 2024 API
Space.ConditionType Property
Get or set the Condition type of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ConditionType ConditionType { get; set; }
Visual Basic
Public Property ConditionType As ConditionType
	Get
	Set
Visual C++
public:
property ConditionType ConditionType {
	ConditionType get ();
	void set (ConditionType value);
}
Remarks
This property is used to get or set the Condition type of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace